title: Disable Defender Real Time Monitoring
description: Rileva l'esecuzione di comandi PowerShell mirati a disattivare la protezione in tempo reale di Windows Defender.
status: experimental
author: Mattia
logsource:
  product: windows
  category: ps_script
detection:
  selection:
    EventID: 4104
    ScriptBlockText|contains:
      - 'DisableRealtimeMonitoring'
  condition: selection
level: high
tags:
  - attack.defense_evasion
  - attack.t1562.001
