title: Detection of Encoded PowerShell Command
description: Rileva l'esecuzione di comandi PowerShell codificati per nascondere l'attività ai sistemi di monitoraggio.
status: experimental
author: Mattia
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4688
    NewProcessName|endswith: '\powershell.exe'
    CommandLine|contains:
      - 'encodedcommand'
      - '-encoded'
      - '-enc'
      - '-e '
  condition: selection
level: high
tags:
  - attack.defense_evasion
  - attack.t1059.001
