title: Rilevamento Ticket Kerberos con Crittografia Debole (RC4)
id: 56bff535-49e2-4734-9f44-f76d7feaadeb
status: experimental
description: Rileva la richiesta di ticket Kerberos (TGS) che utilizzano la crittografia debole RC4 (0x17), escludendo gli account macchina.
references:
    - [https://mitre.org](https://mitre.org)
author: Mattia
date: 2026/06/22
tags:
    - attack.credential_access
    - attack.t1558.003
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4769
        TicketEncryptionType: '0x17'
    filter_machine_accounts:
        TargetUserName|endswith: '$'
    condition: selection and not filter_machine_accounts
falsepositives:
    - Sistemi legacy che non supportano AES
    - Configurazioni errate di dominio
level: medium
