title: Detection of Lateral Movement via PsExec
id: d8d92a14-2c3d-4e5f-8a9b-cdef01234567 
status: experimental
description: Rileva l'installazione di un nuovo servizio di sistema associato a PsExec, una utility legittima della suite Sysinternals di Microsoft
author: Mattia
date: 2026/06/10
modified: 2026/06/10
tags:
    - attack.lateral_movement
    - attack.t1569.002
logsource:
    category: service_creation
    product: windows 
detection:
    sezione_EventoID:
        EventID:
            - 7045 
            - 4697
    sezione_ricerca:
        ServiceName|contains: 'PSEXESVC'
    condition: sezione_EventoID and sezione_ricerca
falsepositives:
    - Utilizzo legittimo di PsExec da parte di amministratori di sistema
    - Scansioni di vulnerabilità autorizzate che utilizzano PsExec
level: high
