title: Event Log Cleared
description: Rileva la cancellazione effettiva dei registri degli eventi Security o System.
status: experimental
author: Mattia
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID:
      - 1102  # Security Log Cleared
      - 104   # System Log Cleared
  condition: selection
level: high
tags:
  - attack.defense_evasion
  - attack.t1070.001
