title: RDP Session Hijacking via Tscon Utility
id: b349cdef-4932-4fb3-a9d1-156302abcdef
status: experimental
description: Rileva l'abuso dello strumento nativo tscon.exe per connettersi forzatamente a sessioni RDP esistenti o disconnesse senza reinserire le credenziali (sfruttando i privilegi di SYSTEM).
author: Mattia Pertusati
date: 2026/06/10
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\tscon.exe'
        CommandLine|contains: '/dest:rdp-tcp'
    condition: selection
falsepositives:
    - Amministratori di helpdesk o sysadmin che gestiscono sessioni utente remote bloccate.
level: high
tags:
    - attack.lateral_movement
    - attack.t1563.002
