title: Rilevamento Esecuzioni Anomale di Rundll32
id: 550e8400-e29b-41d4-a716-446655440000
status: experimental
description: Identifica l'esecuzione di rundll32.exe da percorsi insoliti o con genitori sospetti (possibile esecuzione di DLL malevole o dropper).
author: Mattia
date: 2026/07/20
tags:
    - attack.defense_evasion
    - attack.t1218.011
logsource:
    category: process_creation
    product: windows
detection:
    selection_image:
        Image|endswith: '\rundll32.exe'
    filter_parent:
        ParentImage|endswith:
            - '\svchost.exe'
            - '\msiexec.exe'
            - '\explorer.exe'
    selection_commandline:
        CommandLine|contains:
            - '\Users\'
            - '\Temp\'
            - '\ProgramData\'
    condition: selection_image and selection_commandline and not filter_parent
fields:
    - Computer
    - User
    - CommandLine
    - ParentImage
    - ParentCommandLine
falsepositives:
    - Attività amministrative legittime o installazioni software.
level: medium
