title: Detection of Scheduled Task Creation for Persistence
description: Rileva la creazione di una task programmata nel sistema per scopi di persistenza.
status: experimental
author: Mattia
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4698
  condition: selection
level: high
tags:
  - attack.persistence
  - attack.t1053.005
