SecurityEvent
| where EventID == 4769
| where TicketEncryptionType == "0x17"
| where Account !endswith "$"
| project Account, ServiceName, IpAddress
| summarize count() by Account, ServiceName, IpAddress
