SecurityEvent
| where EventID == 4688
| where ProcessName endswith "powershell.exe"
| where CommandLine has_any ("-enc", "-e", "encodedcommand")
| project TimeGenerated, Computer, Account, ProcessName, CommandLine
