[Detection 01 - Encoded PowerShell Command]
# 1. METADATI
description = Rileva l'esecuzione di PowerShell con parametri di offuscamento e codifica in Base64 per nascondere payload maligni.
search = index=wineventlog EventCode=4688 New_Process_Name="*powershell.exe" (Process_Command_Line="* -enc*" OR Process_Command_Line="* -e *" OR Process_Command_Line="* -encoded*") | table _time, host, Account_Name, New_Process_Name, Process_Command_Line

# 2. SCHEDULAZIONE
enableSched = 1

# 3. CONDIZIONE DI INNESCO
cron_schedule = */15 * * * * 
counttype = number of events
relation = greater than
quantity = 0

# 4. AZIONE
action.email = 1
action.email.to = soc@tuoazienda.com
action.email.subject = 🚨 CRITICAL: PowerShell Offuscato rilevato sull'host $result.host$

[Detection 02 - Local User Creation]
# 1. METADATI
description = Rileva la creazione di Account/Utenti in locale possibilmente creati per ottenere persistenza da parte dell'attaccante.
search = index=wineventlog EventCode=4720 | eval Creator_Account=mvindex(Account_Name, 0) | table _time, host, Creator_Account, SAM_Account_Name

# 2. SCHEDULAZIONE
enableSched = 1

# 3. CONDIZIONE DI INNESCO
cron_schedule = */15 * * * *
counttype = number of events
relation = greater than
quantity = 0

# 4. AZIONE
action.email = 1
action.email.to = soc@tuoazienda.com
action.email.subject = 🚨 CRITICAL: Account Locale rilevato sull'host $result.host$

[Detection 03 - Local Privilege Escalation]
# 1. METADATI
description = Rileva l'aggiunta di Privilegi di amministratore ad un account locale creato per ottenere persistenza.
search = index=wineventlog EventCode=4732 Group_Name=Administrators | eval Creator_Account=mvindex(Account_Name, 0) | eval Added_Account_SID=mvindex(Security_ID, 1) | table _time, host, Creator_Account, Group_Name, Added_Account_SID

# 2. SCHEDULAZIONE
enableSched = 1

# 3. CONDIZIONE DI INNESCO
cron_schedule = */15 * * * *
counttype = number of events
relation = greater than
quantity = 0

# 4. AZIONE
action.email = 1
action.email.to = soc@tuoazienda.com
action.email.subject = 🚨 CRITICAL: Privilege Escalation rilevata sull'host $result.host$ nell'account $result.Added_Account_SID$

[Detection 04 - Windows Defender Evasion ]
# 1. METADATI
description = Rileva la disattivazione della protezione in tempo reale di Windows.
search = index=wineventlog source="*PowerShell*" (EventCode=4103 OR EventCode=4104) "Set-MpPreference" "DisableRealtimeMonitoring" | table _time, host, EventCode, Message

# 2. SCHEDULAZIONE
enableSched = 1

# 3. CONDIZIONE DI INNESCO
cron_schedule = */15 * * * *
counttype = number of events
relation = greater than
quantity = 0

# 4. AZIONE
action.email = 1
action.email.to = soc@tuoazienda.com
action.email.subject = 🚨 CRITICAL: Windows Defender disattivato rilevato sull'host $result.host$

[Detection 05 - Scheduled Task Creation for Persistence ]
# 1. METADATI
description = Rileva la creazione di attività schedulate al riavvio per persistenza da parte dell'attaccante.
search = index=wineventlog EventCode=4698 | rex field=_raw "<Command>(?<Task_Command>[^<]+)</Command>" | table _time, host, Account_Name, Task_Name, Task_Command

# 2. SCHEDULAZIONE
enableSched = 1

# 3. CONDIZIONE DI INNESCO
cron_schedule = */15 * * * *
counttype = number of events
relation = greater than
quantity = 0

# 4. AZIONE
action.email = 1
action.email.to = soc@tuoazienda.com
action.email.subject = 🚨 CRITICAL: Task Schedulata creata rilevata sull'host $result.host$

[Detection 06 - LSASS Memory Dumping ]
# 1. METADATI
description = Rileva il dumping della memoria del servizio LSASS per ottenere una copia full delle credenziali.
search = index=sysmon EventCode=1 "comsvcs.dll" "MiniDump" | table _time, host, CommandLine
 
# 2. SCHEDULAZIONE
enableSched = 1

# 3. CONDIZIONE DI INNESCO
cron_schedule = */15 * * * *
counttype = number of events
relation = greater than
quantity = 0

# 4. AZIONE
action.email = 1
action.email.to = soc@tuoazienda.com
action.email.subject = 🚨 CRITICAL: Dump LSASS rilevato sull'host $result.host$

[Detection 07 - Lateral Movement via PsExec ]
# 1. METADATI
description = Rileva il movimento laterale tramite PsExec per ottenere il ruolo di SYSTEM.
search = index=wineventlog (EventCode=7045 OR EventCode=4697) "*PSEXESVC*" | table _time, host, EventCode, Account_Name, Service_Name, Service_File_Name
 
# 2. SCHEDULAZIONE
enableSched = 1

# 3. CONDIZIONE DI INNESCO
cron_schedule = */15 * * * *
counttype = number of events
relation = greater than
quantity = 0

# 4. AZIONE
action.email = 1
action.email.to = soc@tuoazienda.com
action.email.subject = 🚨 CRITICAL: Movimento Laterale tramite PsExec rilevato sull'host $result.host$

[Detection 08 - Malicious Firewall Rule Creation via Netsh ]
# 1. METADATI
description = Rileva la modifica del Firewall con l'inserimento di una regola non permessa.
search = index=* (EventCode=4688 OR EventCode=1) "*netsh*" "*add rule*" "*allow*" | rex field=_raw "name=\"(?<nome_regola>[^\"]+)\"" | eval New_Account_Name=mvindex(Account_Name, 0) | table _time, host, EventCode, New_Account_Name, CommandLine, Image, nome_regola, Creator_Process_Name
 
# 2. SCHEDULAZIONE
enableSched = 1

# 3. CONDIZIONE DI INNESCO
cron_schedule = */15 * * * *
counttype = number of events
relation = greater than
quantity = 0

# 4. AZIONE
action.email = 1
action.email.to = soc@tuoazienda.com
action.email.subject = 🚨 CRITICAL: Modifica al Firewall rilevata sull'host $result.host$

[Detection 09 - Event Log Clearing ]
# 1. METADATI
description = Rileva la pulizia dei log da parte dell'attaccante per ripulire le sue azioni.
search = index=wineventlog (EventCode=1102 OR EventCode=104) | table _time, host, EventCode, Account_Name, TaskCategory

# 2. SCHEDULAZIONE
enableSched = 1

# 3. CONDIZIONE DI INNESCO
cron_schedule = */15 * * * *
counttype = number of events
relation = greater than
quantity = 0

# 4. AZIONE
action.email = 1
action.email.to = soc@tuoazienda.com
action.email.subject = 🚨 CRITICAL: Pulizia dei Log rilevata sull'host $result.host$

[Detection 10 - RDP Session Hijacking via Tscon ]
# 1. METADATI
description = Rileva l'uso di Tscon per recuperare sessioni RDP aperte in background.
search = index=wineventlog EventCode=4688 "*tscon*" "*/dest:*" | eval New_Account_Name=mvindex(Account_Name, 0) | table _time, host, New_Account_Name, Process_Command_Line

# 2. SCHEDULAZIONE
enableSched = 1

# 3. CONDIZIONE DI INNESCO
cron_schedule = */15 * * * *
counttype = number of events
relation = greater than
quantity = 0

# 4. AZIONE
action.email = 1
action.email.to = soc@tuoazienda.com
action.email.subject = 🚨 CRITICAL: RDP Session Hijacking rilevato sull'host $result.host$

